<?php
/**
 * Project: Gravatar 4 SMF
 * File: .russian-utf8.php
 * Author: digger
 * Date: 06.09.12
 * License: CC BY-NC-ND http://creativecommons.org/licenses/by-nc-nd/3.0/
 */

$txt['gravatar_admin_menu'] = 'Граватар';
$txt['gravatar_enabled'] = 'Включить граватары';
$txt['gravatar_rating'] = 'Допустимый рейтинг изображений';
$txt['gravatar_rating_g'] = 'G';
$txt['gravatar_rating_pg'] = 'PG';
$txt['gravatar_rating_r'] = 'R';
$txt['gravatar_rating_x'] = 'X';
$txt['gravatar_rating_help'] = '
<br />G - граватары с рейтингом G пригодны для показа на сайтах с любой аудиторией
<br />PG - граватары с рейтингом PG могут содержать неприличные жесты, провокационно одетых людей, грубые выражения или умеренную жестокость
<br />R - граватары с рейтингом R могут быть оскорбительными, содержать сцены жестокости, обнаженные тела или связанные с наркотиками
<br />X - граватары с рейтингом X могут содержать откровенные сексуальные изображения или сцены экстремальной жестокости';
$txt['gravatar_style'] = 'Выберите стиль граватаров по умолчанию';
$txt['gravatar_style_wavatar'] = 'лица';
$txt['gravatar_style_identicon'] = 'геометрия';
$txt['gravatar_style_monsterid'] = 'монстры';
$txt['gravatar_style_retro'] = 'ретро';
$txt['gravatar_style_mm'] = 'загадочный человек';
$txt['gravatar_style_help'] = '<br />Если у пользователя есть свой граватар на <a href="http://gravatar.com" target="_blank">gravatar.com</a>, то будет использован он. Для пользователей, которые не установили себе аватар, будут сгенерированы уникальные изображения в заданном стиле. Размер граватаров будет соответствовать настройкам форума для внешних аватаров.
<br /><br />Стили граватаров:
<br />лица - сгенерированные лица с разными чертами
<br />геометрия - геометрические рисунки
<br />монстры - сгенерированные монстры с разными лицами, цветом и другими свойствами
<br />ретро - сгенерированные пикселизованные лица в стиле 8-битных аркад
<br />загадочный человек - абстрактный силуэт одинаковый для всех';
